#include <stdio.h>

void main(){
	printf("이 름	전공학과	학년\n");
	printf("%s	%s	%s\n\n", "이 름", "전공학과", "학년");

	// %[- or 생략][전체크기][포맷스트링]
	// [첫번째] 왼쪽 정렬 / 오른쪽 정렬
	// [두번째] 매칭되는 값이 차지하는 byte공간
	// [세번째] c ,d, ,ll ,f ,lf ...
	printf("%-8s %14s %5s \n",  "이 름", "전공학과", "학년");
	printf("%-8s %14s %5d \n",  "조문수", "컴퓨터공학", 3);
	printf("%-8s %14s %5d \n",  "김혜경", "전자공학", 1);
	printf("%-8s %14s %5d \n\n",  "한상수", "심리학", 4);

	// 11~14 line 전체 왼쪽 정렬
	printf("======= 전체 왼쪽 정렬 =======\n\n");
	printf("%-8s %-14s %-5s \n",  "이 름", "전공학과", "학년");
	printf("%-8s %-14s %-5d \n",  "조문수", "컴퓨터공학", 3);
	printf("%-8s %-14s %-5d \n",  "김혜경", "전자공학", 1);
	printf("%-8s %-14s %-5d \n\n",  "한상수", "심리학", 4);
	
	// 11~14 line 전체 오른쪽 정렬
	printf("======= 전체 오른쪽 정렬 =======\n\n");
	printf("%8s %14s %5s \n",  "이 름", "전공학과", "학년");
	printf("%8s %14s %5d \n",  "조문수", "컴퓨터공학", 3);
	printf("%8s %14s %5d \n",  "김혜경", "전자공학", 1);
	printf("%8s %14s %5d \n\n",  "한상수", "심리학", 4);
	
	// 11~14 line 전체 중앙 정렬
	printf("======= 전체 중앙 정렬 =======\n\n");
	printf("%5s %14s %7s \n",  "이름", "전공학과", "학년");
	printf("%6s %14s %5d \n",  "조문수", "컴퓨터공학", 3);
	printf("%6s %13s %6d \n",  "김혜경", "전자공학", 1);
	printf("%6s %12s %7d \n",  "한상수", "심리학", 4);

}
